examples/demo-skaffold/compiled/greet-flow/artifacts/flow.dot
digraph "greet_flow" {
    rankdir=TB;
    node [shape=box, style=filled, fontname="Helvetica"];

    { rank=source; start_greet_flow; }

    router_greet_flow_seq_set_greet [label="router_greet_flow_seq_set_greet\n\np['greet'] = greet(p)\np['shout'] = shout(p)", fillcolor=wheat];
    start_greet_flow [label="start_greet_flow", fillcolor=palegreen];

    __end__ [label="", shape=doublecircle, fillcolor=black, width=0.3, fixedsize=true];

    start_greet_flow -> router_greet_flow_seq_set_greet;
    router_greet_flow_seq_set_greet -> __end__;
}
